Did some test with a data-generator sink on my side:

1. The tf file
```
terraform {
  required_providers {
    pulsar = {
      version = "0.2.3"
      source = "registry.terraform.io/streamnative/pulsar"
    }
  }
}

provider "pulsar" {
  web_service_url = "?????????"
  audience = "urn:sn:pulsar:sndev:neng-test"
  issuer_url = "https://auth.streamnative.cloud/"
  key_file_path = "/Users/nlu/Downloads/sndev-admin.json"
  api_version = 3
}

resource "pulsar_sink" "sample-sink-1" {
  provider = pulsar

  name                  = "testsink"
  tenant                = "sn"
  namespace             = "system"
  subscription_position = "Earliest"
  subscription_name     = "testsink"
  inputs                = ["public/default/output"]
  cleanup_subscription  = true
  parallelism           = 2
  auto_ack              = true
  archive               = "builtin://data-generator"
  retain_ordering       = false
  processing_guarantees = "ATLEAST_ONCE"
  cpu                   = 1
  ram_mb                = 1024
}
```


2. initial apply
```
➜  tf-test terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pulsar_sink.sample-sink-1 will be created
  + resource "pulsar_sink" "sample-sink-1" {
      + archive                = "builtin://data-generator"
      + auto_ack               = true
      + classname              = (known after apply)
      + cleanup_subscription   = true
      + configs                = (known after apply)
      + cpu                    = 1
      + custom_runtime_options = (known after apply)
      + disk_mb                = (known after apply)
  1 terraform {
      + id                     = (known after apply)
      + inputs                 = [
          + "public/default/output",
        ]
      + name                   = "testsink"
      + namespace              = "system"
      + parallelism            = 1
      + processing_guarantees  = "ATLEAST_ONCE"
      + ram_mb                 = 1024
      + retain_ordering        = false
      + subscription_name      = "testsink"
      + subscription_position  = "Earliest"
      + tenant                 = "sn"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pulsar_sink.sample-sink-1: Creating...
pulsar_sink.sample-sink-1: Creation complete after 2s [id=sn/system/testsink]
```

2. update the inputs:
```
➜  tf-test terraform apply
pulsar_sink.sample-sink-1: Refreshing state... [id=sn/system/testsink]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # pulsar_sink.sample-sink-1 will be updated in-place
  ~ resource "pulsar_sink" "sample-sink-1" {
        id                               = "sn/system/testsink"
      ~ inputs                           = [
          - "public/default/output",
          + "public/default/input",
        ]
        name                             = "testsink"
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pulsar_sink.sample-sink-1: Modifying... [id=sn/system/testsink]
╷
│ Error: code: 400 reason: Input Topics cannot be altered
│
│   with pulsar_sink.sample-sink-1,
│   on main.tf line 18, in resource "pulsar_sink" "sample-sink-1":
│   18: resource "pulsar_sink" "sample-sink-1" {
│
```

3. update the parallelism
```
➜  tf-test terraform apply
pulsar_sink.sample-sink-1: Refreshing state... [id=sn/system/testsink]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # pulsar_sink.sample-sink-1 will be updated in-place
  ~ resource "pulsar_sink" "sample-sink-1" {
        id                               = "sn/system/testsink"
        name                             = "testsink"
      ~ parallelism                      = 1 -> 2
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pulsar_sink.sample-sink-1: Modifying... [id=sn/system/testsink]
pulsar_sink.sample-sink-1: Modifications complete after 2s [id=sn/system/testsink]
```

4. update the retain ordering:
```
➜  tf-test terraform apply
pulsar_sink.sample-sink-1: Refreshing state... [id=sn/system/testsink]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # pulsar_sink.sample-sink-1 will be updated in-place
  ~ resource "pulsar_sink" "sample-sink-1" {
        id                               = "sn/system/testsink"
        name                             = "testsink"
      ~ retain_ordering                  = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pulsar_sink.sample-sink-1: Modifying... [id=sn/system/testsink]
╷
│ Error: code: 400 reason: Retain Ordering cannot be altered
│
│   with pulsar_sink.sample-sink-1,
│   on main.tf line 18, in resource "pulsar_sink" "sample-sink-1":
│   18: resource "pulsar_sink" "sample-sink-1" {
│
╵
```

5. run apply without any change:
```
➜  tf-test terraform apply
pulsar_sink.sample-sink-1: Refreshing state... [id=sn/system/testsink]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

